# Типы данных в питоне

# 1. NoneType - Ничего, пустота -> None
# 2. Boolean - Истина или ложь -> True/False
# 3. str() - Строки -> 'Hello world', "My name is John"
# 4. Числовые типы данных;
     # a. integer - int() - Целое число (-1, -2, 0, 1)
     # b. float() - Число в плаващей точкой (-1.2, 10.15, 2.7)
     # c. complex() - Комлексные числа (3+5i6)
# 5. Списковые тип данных:
     # a) list (список/массив)
     # b) tuplpe (кортеж) -> (1, 2, 3, 4, None)
     # c) range (последовательность) -> range (1, 10)
# 6. set() -> Множества
# 7. dict (словари) -> содержит данные в виде ключа и значения -> {1: 'One', 2: 'Two'}    

# ******************************
# Mutable (изменяемые типы данных)
#    1. list
#    2. set
#    3. dict

# Immitable (незменяемые типы данных)
#    1. NoneType
#    2. boolean
#    3. int float complex
#    4. str
#    5. range
#    6. tuple
#    7. frozenset
# *******************************

'''Стандартный ввывод данных'''
"""
в пайтоне для выввода данных в терминал используется встроенная функция print()
"""
# print ('Hello world! My name is Sanzhar!')
# print (27+5)

'''Стандартный ввод данных через терминал использкнтся функция input()'''
# a = input('Введите число: ')
# print('В a хранится')
# print (a)

# print(input('Введите свое имя: '))
print(input(''))









